# Задача 12
# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих 
# чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# Пример:

# 4 4 -> 2 2
# 5 6 -> 2 3

S = int(input('Введите S: '))
P = int(input('Введите P: '))
X = 0
Y = 0

X = round((S + ((S * S - 4 * P) ** (0.5))) * 0.5)
Y = S - X

if 0 < X <= 1000 and 0 < Y <= 1000:   
    print(X, Y)
else:
    print('X и Y не натуральные числа' )
